{
  "pt-br": {
    "header_about": "Sobre",
    "header_projects": "Projetos do Github",
    "header_contact": "Contato",
    "hero_title": "Desenvolvedor Java e Kotlin",
    "hero_subtitle": "Crio soluções limpas, escaláveis e funcionais com foco em performance, qualidade e valor real ao cliente.",
    "hero_cta": "Fale comigo",
    "about_title": "Quem sou eu?",
    "about_p1": "Sou desenvolvedor com sólida experiência em Java e Kotlin, apaixonado por criar soluções limpas, escaláveis e funcionais. Tenho histórico em desenvolvimento de APIs, integração de sistemas e melhoria de performance em ambientes críticos.",
    "about_p2": "Além da técnica, prezo pelo compromisso, pela entrega com qualidade e pelo respeito ao cliente e à equipe. Já atuei em projetos de diferentes portes, sempre buscando aplicar boas práticas, como SOLID, Clean Architecture e testes automatizados.",
    "projects_title": "Projetos",
    "projects_placeholder": "Os projetos serão inseridos aqui via JavaScript",
    "legacy_title": "Projetos Comerciais e Legados",
    "contact_title": "Entre em contato",
    "contact_subtitle": "Está com um projeto em mente ou quer conversar sobre tecnologia? Me chame:",
    "contact_email": "Email:",
    "contact_github": "GitHub:",
    "footer": "© 2025 Fabiano Cesar. Todos os direitos reservados.",
    "github_no_description": "Sem descrição.",
    "github_language": "Linguagem:",
    "github_view": "Ver no GitHub"
  },
  "en": {
    "header_about": "About",
    "header_projects": "Github Projects",
    "header_contact": "Contact",
    "hero_title": "Java and Kotlin Developer",
    "hero_subtitle": "I create clean, scalable, and functional solutions with a focus on performance, quality, and real value for the client.",
    "hero_cta": "Talk to me",
    "about_title": "Who am I?",
    "about_p1": "I am a developer with solid experience in Java and Kotlin, passionate about creating clean, scalable, and functional solutions. I have a track record in API development, system integration, and performance improvement in critical environments.",
    "about_p2": "Beyond technology, I value commitment, quality delivery, and respect for the client and the team. I have worked on projects of different sizes, always seeking to apply good practices like SOLID, Clean Architecture, and automated tests.",
    "projects_title": "Projects",
    "projects_placeholder": "Projects will be inserted here via JavaScript",
    "legacy_title": "Commercial and Legacy Projects",
    "contact_title": "Get in touch",
    "contact_subtitle": "Have a project in mind or want to talk about technology? Reach out to me:",
    "contact_email": "Email:",
    "contact_github": "GitHub:",
    "footer": "© 2025 Fabiano Cesar. All rights reserved.",
    "github_no_description": "No description.",
    "github_language": "Language:",
    "github_view": "View on GitHub"
  },
  "es": {
    "header_about": "Sobre",
    "header_projects": "Proyectos de Github",
    "header_contact": "Contacto",
    "hero_title": "Desarrollador Java y Kotlin",
    "hero_subtitle": "Creo soluciones limpias, escalables y funcionales con enfoque en rendimiento, calidad y valor real para el cliente.",
    "hero_cta": "Háblame",
    "about_title": "¿Quién soy yo?",
    "about_p1": "Soy desarrollador con sólida experiencia en Java y Kotlin, apasionado por crear soluciones limpias, escalables y funcionales. Tengo un historial en el desarrollo de APIs, integración de sistemas y mejora del rendimiento en entornos críticos.",
    "about_p2": "Más allá de la técnica, valoro el compromiso, la entrega de calidad y el respeto por el cliente y el equipo. He trabajado en proyectos de diferentes tamaños, siempre buscando aplicar buenas prácticas como SOLID, Clean Architecture y pruebas automatizadas.",
    "projects_title": "Proyectos",
    "projects_placeholder": "Los proyectos se insertarán aquí a través de JavaScript",
    "legacy_title": "Proyectos Comerciales y Legados",
    "contact_title": "Ponte en contacto",
    "contact_subtitle": "¿Tienes un proyecto en mente o quieres hablar de tecnología? Llámame:",
    "contact_email": "Correo electrónico:",
    "contact_github": "GitHub:",
    "footer": "© 2025 Fabiano Cesar. Todos los derechos reservados.",
    "github_no_description": "Sin descripción.",
    "github_language": "Idioma:",
    "github_view": "Ver en GitHub"
  }
}
